<a href="https://colab.research.google.com/github/wellmej/DataScienceUseCases/blob/main/SQL_Create_Table_from_CSV.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Working with CSV, JSON and EXCEL Files
##### Pandas

In [ ]:
#--------------------------------------------
# Import the Pandas libraries
#--------------------------------------------
import pandas as pd

In [ ]:
#------------------------------------------------
# Set full file path names
#------------------------------------------------
#folder_name = 'C:/Users/jrwel/Documents/Udemy/Python Mega Course/Data/Supermarket/'
folder_name = 'C:/Users/jrwel/Documents/Python Scripts/Data/'
file_name = 'Database Table Definition Info.txt'
csv_in_file = folder_name + file_name

out_file_name = 'Database Table Create Output_ZSAssociates.sql'
out_file = folder_name + out_file_name

In [ ]:
#------------------------------------------------
# Read .CSV file into a dataframe
#------------------------------------------------
#df_database_info = pd.read_csv(csv_in_file, encoding = "latin1" )
df_database_info = pd.read_csv(csv_in_file )
df_database_info.head(10)

    Column_Header  Column_Order  Length_of_Field Type
0        CASE_NUM             7                7    v
1        CERT_NUM             8                4    v
2        CLMT_NUM             9                1    v
3         DIV_NUM            10                3    v
4        PLAN_NUM            11                5    v
5         EMP_SSN            12               11    v
6   EMP_LAST_NAME            13               25    v
7  EMP_FIRST_NAME            14               15    v
8             SSN            15               11    v
9       LAST_NAME            16               25    v

In [ ]:
#------------------------------------------------
# Listing files in current directory
#------------------------------------------------
import os
#os.listdir()

In [ ]:
sqlBegin = 'CREATE TABLE '
sqlTable = '[EDExtract].[dbo].[DometicNonMedicalEligibilityExtract]'
sqlNULL = 'NULL'
sqlNOTNULL = 'NOT NULL'
sqlDefFileFormatId = '@DefFileFormatId'
sqlDefFileRowLayoutId = '@DefFileRowLayoutId'
sqlZero = '0'
sqlComma = ','
sqlOpenBracket = '['
sqlOpenParen = '('
sqlCloseBracket = ']'
sqlCloseParen = ')'
sqlSpace = ' '
sqlVarChar = '[varchar]'

sqlEnd = ')'

sqlConstraint = ' CONSTRAINT [PK_DometicNonMedicalEligibilityExtract] PRIMARY KEY CLUSTERED'
sqlCons1 = '[RowId] ASC' + sqlComma
sqlCons2 = '[FileId] ASC' + sqlComma
sqlCons3 = '[ExecutionId] ASC'
sqlWith = sqlCloseParen + 'WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON) ON [PRIMARY]'
sqlStorage = sqlCloseParen + ' ON [PRIMARY]'
i = 0

In [ ]:
for ind, row in df_database_info.iterrows():
    if row['Type'] == 'v':
        df_database_info.loc[ind, "SQL_Create_Tbl"] = sqlOpenBracket + row['Column_Header'] + sqlCloseBracket + sqlSpace  + sqlVarChar + sqlOpenParen +  str(row['Length_of_Field']) + sqlCloseParen + sqlSpace + sqlNULL + sqlComma

In [ ]:
#f = open(out_file, 'w', encoding="latin1")
f = open(out_file, 'w')
f.write(sqlBegin + sqlTable + '\n')
f.write(sqlOpenParen + '\n')
for ind, row in df_database_info.iterrows():
    if i > len(df_database_info):
       break
    else:
#       f = open(str(i)+'.txt', 'w')
       f.write(row ['SQL_Create_Tbl'] + '\n')
       print (row['SQL_Create_Tbl']) 
       i+=1
#
f.write(sqlConstraint + '\n')
f.write(sqlOpenParen + '\n')
f.write(sqlCons1 + '\n')
f.write(sqlCons2 + '\n')
f.write(sqlCons3+ '\n')
f.write(sqlWith + '\n')
f.write(sqlStorage + '\n')
#
f.close()

[CASE_NUM] [varchar](7) NULL,
[CERT_NUM] [varchar](4) NULL,
[CLMT_NUM] [varchar](1) NULL,
[DIV_NUM] [varchar](3) NULL,
[PLAN_NUM] [varchar](5) NULL,
[EMP_SSN] [varchar](11) NULL,
[EMP_LAST_NAME] [varchar](25) NULL,
[EMP_FIRST_NAME] [varchar](15) NULL,
[SSN] [varchar](11) NULL,
[LAST_NAME] [varchar](25) NULL,
[FIRST_NAME] [varchar](15) NULL,
[BIRTH_DATE] [varchar](10) NULL,
[STATE] [varchar](2) NULL,
[RELATION] [varchar](8) NULL,
[DOCUMENT_NUM] [varchar](10) NULL,
[BILL_REFERENCE_NUM] [varchar](10) NULL,
[BILL_ENTRY_NUM] [varchar](4) NULL,
[CLAIM_STATUS] [varchar](8) NULL,
[DOS_INITIAL] [varchar](10) NULL,
[DOS_FINAL] [varchar](10) NULL,
[PAID_DATE] [varchar](10) NULL,
[TAX_ID] [varchar](11) NULL,
[SUB_TIN] [varchar](3) NULL,
[PROVIDER] [varchar](30) NULL,
[PROV_TYPE] [varchar](4) NULL,
[PROV_SPECIALTY] [varchar](50) NULL,
[PROV_ADDRESS] [varchar](60) NULL,
[PROV_CITY] [varchar](15) NULL,
[PROV_STATE] [varchar](2) NULL,
[PROV_ZIP] [varchar](10) NULL,
[PROV_PHONE] [varchar](14) NULL,
[PROV_FAX] [varchar](14) NULL,
[POS] [varchar](2) NULL,
[POS_DESC] [varchar](50) NULL,
[PLACE_TYPE] [varchar](2) NULL,
[NETWORK] [varchar](4) NULL,
[ICD_CODE] [varchar](7) NULL,
[ICD_DESC] [varchar](30) NULL,
[ICD_CODE_2"] [varchar](2) NULL,
[ICD_DESC_2"] [varchar](30) NULL,
[ICD_CODE_3"] [varchar](7) NULL,
[ICD_DESC_3"] [varchar](30) NULL,
[ICD_CODE_4"] [varchar](7) NULL,
[ICD_DESC_4"] [varchar](30) NULL,
[ICD_CODE_5"] [varchar](7) NULL,
[ICD_DESC_5"] [varchar](30) NULL,
[ICD_CODE_6"] [varchar](7) NULL,
[ICD_DESC_6"] [varchar](30) NULL,
[CHARGE_TYPE] [varchar](4) NULL,
[CHARGE_DESC] [varchar](20) NULL,
[CLAIM_TYPE] [varchar](10) NULL,
[PROC_TYPE] [varchar](4) NULL,
[PROC_CODE] [varchar](11) NULL,
[PROC_MOD1"] [varchar](2) NULL,
[PROC_MOD2"] [varchar](2) NULL,
[PROC_MOD3"] [varchar](2) NULL,
[PROC_MOD4"] [varchar](2) NULL,
[PROC_DESC] [varchar](60) NULL,
[ALLOWED] [varchar](12) NULL,
[INEL_CODE] [varchar](3) NULL,
[INEL] [varchar](12) NULL,
[ELIGIBLE] [varchar](12) NULL,
[DED] [varchar](12) NULL,
[OOP] [varchar](12) NULL,
[COPAY] [varchar](12) NULL,
[COINS] [varchar](12) NULL,
[PAID] [varchar](12) NULL,
[PAID_MO] [varchar](2) NULL,
[PAID_YR] [varchar](4) NULL,
[SERVICE_MO] [varchar](2) NULL,
[SERVICE_YR] [varchar](4) NULL,

In [ ]:
#for index, row in p.iterrows():
#    if i > len(p):
#       break
#    else:
#       f = open(str(i)+'.txt', 'w')
#       f.write(row[0])
#       f.close()
#       i+=1

In [ ]:
df_database_info.head(20)

,Column_Header,Column_Order,Length_of_Field,Type,SQL_Create_Tbl
0,CASE_NUM,7,7,v,"[CASE_NUM] [varchar](7) NULL,"
1,CERT_NUM,8,4,v,"[CERT_NUM] [varchar](4) NULL,"
2,CLMT_NUM,9,1,v,"[CLMT_NUM] [varchar](1) NULL,"
3,DIV_NUM,10,3,v,"[DIV_NUM] [varchar](3) NULL,"
4,PLAN_NUM,11,5,v,"[PLAN_NUM] [varchar](5) NULL,"
5,EMP_SSN,12,11,v,"[EMP_SSN] [varchar](11) NULL,"
6,EMP_LAST_NAME,13,25,v,"[EMP_LAST_NAME] [varchar](25) NULL,"
7,EMP_FIRST_NAME,14,15,v,"[EMP_FIRST_NAME] [varchar](15) NULL,"
8,SSN,15,11,v,"[SSN] [varchar](11) NULL,"
9,LAST_NAME,16,25,v,"[LAST_NAME] [varchar](25) NULL,"
10,FIRST_NAME,17,15,v,"[FIRST_NAME] [varchar](15) NULL,"
11,BIRTH_DATE,18,10,v,"[BIRTH_DATE] [varchar](10) NULL,"
12,STATE,19,2,v,"[STATE] [varchar](2) NULL,"
13,RELATION,20,8,v,"[RELATION] [varchar](8) NULL,"
14,DOCUMENT_NUM,21,10,v,"[DOCUMENT_NUM] [varchar](10) NULL,"
15,BILL_REFERENCE_NUM,22,10,v,"[BILL_REFERENCE_NUM] [varchar](10) NULL,"
16,BILL_ENTRY_NUM,23,4,v,"[BILL_ENTRY_NUM] [varchar](4) NULL,"
17,CLAIM_STATUS,24,8,v,"[CLAIM_STATUS] [varchar](8) NULL,"
18,DOS_INITIAL,25,10,v,"[DOS_INITIAL] [varchar](10) NULL,"
19,DOS_FINAL,26,10,v,"[DOS_FINAL] [varchar](10) NULL,"